### In this notebook, we are merging the RFM1, RFM2, and RFM3 files with the master CSV to extract cluster information

In [1]:
import numpy as np
import pandas as pd

In [4]:
orig = pd.read_csv("Processed_CLIENT_ID_BRANCH_MASTERSUMMARYTABLEv2.0.csv", header=0, encoding = "ISO-8859-1")

/anaconda/envs/python3/lib/python3.5/site-packages/IPython/core/interactiveshell.py:2683: DtypeWarning: Columns (10,11,13,15,16,17,18,22,23,24,25,26,27,28,29,30) have mixed types. Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

In [5]:
rfm1 = pd.read_csv("RFM_1.csv", header=0, encoding = "ISO-8859-1")

In [300]:
rfm2 = pd.read_csv("RFM_2.csv", header=0, encoding = "ISO-8859-1")

In [14]:
rfm3 = pd.read_csv("RFM_3.csv", header=0, encoding = "ISO-8859-1")

In [174]:
df = orig.copy()

In [133]:
df.columns[0]

'Unnamed: 0'

In [175]:
df = df.rename(columns = {'Unnamed: 0': 'V1'})

In [176]:
df.head()

,V1,CUSTOMER_ID,CUSTOMER_BRANCH,ATLAS_CUSTOMER_MAINCODE_FORDUPLICATE,ACCOUNT_TYPE,LIFECYCLESTAGE,COMMERCIAL_STAGE,ATLAS_STATUS,CUSTOMER_TYPE,CUSTOMER_SUBTYPE,...,TOTAL_BOOKING_DEMAND_RATIO_Y3,TOTAL_BOOKING_DEMAND_RATIO_TOTAL,TOTAL_CANCELLATIONS_COUNT_Y1,TOTAL_CANCELLATIONS_COUNT_Y2,TOTAL_CANCELLATIONS_COUNT_Y3,TOTAL_CANCELLATIONS_COUNT_TOTAL,TOTAL_CANCELLATION_BOOKING_RATIO_Y1,TOTAL_CANCELLATION_BOOKING_RATIO_Y2,TOTAL_CANCELLATION_BOOKING_RATIO_Y3,TOTAL_CANCELLATION_BOOKING_RATIO_TOTAL
0,1,1,1,-9999,BRANCH,4. INACTIVE,LOST,INACTIVE,TRAVEL AGENCY,NaN,...,NaN,NaN,0,0,0,0,NaN,NaN,NaN,NaN
1,2,2,1,31652,DUPLICATE BRANCH,4. INACTIVE,NaN,INACTIVE,TRAVEL AGENCY,FRANCHISE/OWN BRANCHES,...,NaN,NaN,0,0,0,0,NaN,NaN,NaN,NaN
2,3,3,1,-9999,MAIN ACCOUNT,4. INACTIVE,LOST,INACTIVE,TOUR OPERATOR,NaN,...,NaN,NaN,0,0,0,0,NaN,NaN,NaN,NaN
3,4,4,1,-9999,MAIN ACCOUNT,4. INACTIVE,LOST,INACTIVE,TOUR OPERATOR,NaN,...,NaN,NaN,0,0,0,0,NaN,NaN,NaN,NaN
4,5,5,1,-9999,MAIN ACCOUNT,4. INACTIVE,LOST,INACTIVE,TOUR OPERATOR,NaN,...,NaN,NaN,0,0,0,0,NaN,NaN,NaN,NaN

In [8]:
rfm1.head()

,V1,CUSTOMER_ID,CUSTOMER_BRANCH,R1,R2,F1,F2,M1,M2,S1,S2,MainGroup1,MainGroup2,SubGroup1,SubGroup2
0,8,9,1,0,0,10,10,2142.09,1987.87,138.0,150.0,3. Experienced Customers,3. Experienced Customers,NaN,NaN
1,693,19,1,12,12,0,0,0.00,0.00,137.0,149.0,4. Inactive Experienced Customers,4. Inactive Experienced Customers,NaN,NaN
2,700,27,1,0,0,9,12,1979.10,3456.89,89.0,101.0,3. Experienced Customers,3. Experienced Customers,NaN,NaN
3,701,28,1,12,12,0,0,0.00,0.00,130.0,142.0,4. Inactive Experienced Customers,4. Inactive Experienced Customers,NaN,NaN
4,703,30,1,12,12,0,0,0.00,0.00,126.0,138.0,4. Inactive Experienced Customers,4. Inactive Experienced Customers,NaN,NaN

In [136]:
df = df[df.LIFECYCLESTAGE != '4. INACTIVE']

In [137]:
len(df)

77702

In [138]:
len(rfm1)

77702

### Fill subgroup fields in rfm1, rfm2 and rfm3

### RFM1

In [177]:
"""
4 ---> Medium_Risk
3 --> Middle_F
1 --> High_F & Medium_F
2 --> Promising
"""

#Fill Subgroup based on cluster value
def fillSubgroup1(value):
    subg = ''
    if value == 4:
        subg = 'Medium_Risk'
    elif value == 3:
        subg = 'Middle_F'
    elif value == 1:
        subg = 'High_F & Medium_F'
    elif value == 2:
        subg = 'Promising'
    return subg

In [178]:
rfm1['sub1'] = rfm1['SubGroup1'].apply(lambda x: fillSubgroup1(x))

In [179]:
rfm1.sub1.value_counts()

                     74823
Middle_F              1501
Medium_Risk            725
High_F & Medium_F      593
Promising               60
Name: sub1, dtype: int64

In [180]:
rfm1['sub2'] = rfm1['SubGroup2'].apply(lambda x: fillSubgroup(x))

In [181]:
rfm1.sub2.value_counts()

                     74749
Middle_F              1627
Medium_Risk            772
High_F & Medium_F      507
Promising               47
Name: sub2, dtype: int64

In [144]:
rfm1[rfm1['SubGroup2'].notnull()].head()

,V1,CUSTOMER_ID,CUSTOMER_BRANCH,R1,R2,F1,F2,M1,M2,S1,S2,MainGroup1,MainGroup2,SubGroup1,SubGroup2,sub1,sub2
261,2330,1188,1,12,0,0,1,0.0,0.00,-12.0,0.0,0. Future Customers,1. New Customers,NaN,3.0,,Middle_F
397,2923,1627,130,12,0,0,1,0.0,108.22,-12.0,0.0,0. Future Customers,1. New Customers,NaN,3.0,,Middle_F
418,2981,1627,188,12,1,0,2,0.0,41.40,-8.0,4.0,0. Future Customers,1. New Customers,NaN,3.0,,Middle_F
440,3058,1627,265,12,2,0,2,0.0,149.96,-8.0,4.0,0. Future Customers,1. New Customers,NaN,3.0,,Middle_F
459,3096,1627,303,12,4,0,1,0.0,76.00,-8.0,4.0,0. Future Customers,1. New Customers,NaN,4.0,,Medium_Risk

In [145]:
rfm1[rfm1['SubGroup1'].notnull()].head()

,V1,CUSTOMER_ID,CUSTOMER_BRANCH,R1,R2,F1,F2,M1,M2,S1,S2,MainGroup1,MainGroup2,SubGroup1,SubGroup2,sub1,sub2
354,2805,1627,12,5,4,1,2,46.00,144.52,5.0,17.0,1. New Customers,3. Experienced Customers,4.0,NaN,Medium_Risk,
362,2835,1627,42,2,12,2,0,388.14,0.00,3.0,15.0,1. New Customers,4. Inactive Experienced Customers,3.0,NaN,Middle_F,
391,2910,1627,117,5,3,1,1,193.22,19.00,5.0,17.0,1. New Customers,3. Experienced Customers,4.0,NaN,Medium_Risk,
417,2976,1627,183,0,1,2,7,340.00,2406.71,4.0,16.0,1. New Customers,3. Experienced Customers,3.0,NaN,Middle_F,
468,3126,1627,333,2,0,1,3,75.96,181.63,2.0,14.0,1. New Customers,3. Experienced Customers,3.0,NaN,Middle_F,

### RFM2

In [201]:
"""
2	Medium_High_Risk
5	Middle_F
1	High_F & Medium_M
4	Promising
3	Top

Additional parameters: 
if the value in subgroup is already populated: do nothing
"""
def fillSubgroup2(subColV, value):
    subg = ''
    if subColV != '':
        subg = subColV 
    else: 
        if value == 4:
            subg = 'Promising'
        elif value == 3:
            subg = 'Top'
        elif value == 1:
            subg = 'High_F & Medium_M'
        elif value == 2:
            subg = 'Medium_High_Risk'
        elif value == 5:
            subg = 'Middle_F'
    return subg

In [305]:
rfm2['sub1'] = ''
rfm2['sub2'] = ''

rfm2['sub1'] = rfm2.apply(lambda x: fillSubgroup2(x['sub1'], x['SubGroup1']), axis = 1)
rfm2['sub2'] = rfm2.apply(lambda x: fillSubgroup2(x['sub2'], x['SubGroup2']), axis = 1)

In [303]:
rfm2.sub1.value_counts()

                     75338
Middle_F               944
Medium_High_Risk       923
High_F & Medium_M      481
Promising               14
Top                      2
Name: sub1, dtype: int64

In [149]:
#double Check that there are no common values
index1 = rfm2[rfm2['SubGroup1'].notnull()].index
index2 = rfm1[rfm1['SubGroup1'].notnull()].index
uncommon = [x if x in index2 else '' for x in index1]

In [152]:
rfm2['sub2'] = rfm2['SubGroup2'].apply(lambda x: fillSubgroup2(x))

In [306]:
rfm2.sub2.value_counts()

                     75087
Middle_F              1039
Medium_High_Risk      1021
High_F & Medium_M      534
Promising               20
Top                      1
Name: sub2, dtype: int64

### RFM3

In [308]:
"""
7	High_Risk
4	Medium_High_Risk
1	Middle_F
6	High_F & Medium_M
2	Promising
3	Top
5	Elite
"""
def fillSubgroup3(subColV, value):
    subg = ''
    if subColV != '':
        subg = subColV 
    else:
        if value == 4:
            subg = 'Medium_High_Risk'
        elif value == 3:
            subg = 'Top'
        elif value == 1:
            subg = 'Middle_F'
        elif value == 2:
            subg = 'Promising'
        elif value == 5:
            subg = 'Elite'
        elif value == 6:
            subg = 'High_F & Medium_M'
        elif value == 7:
            subg = 'High_Risk'
    return subg

In [309]:
rfm3['sub1'] = ''
rfm3['sub2'] = ''

rfm3['sub1'] = rfm3.apply(lambda x: fillSubgroup3(x['sub1'], x['SubGroup1']), axis = 1)
rfm3['sub2'] = rfm3.apply(lambda x: fillSubgroup3(x['sub2'], x['SubGroup2']), axis = 1)

In [310]:
rfm3.sub1.value_counts()

                     63466
Middle_F              3963
High_F & Medium_M     3466
Promising             3339
Medium_High_Risk      2216
High_Risk             1232
Top                     20
Name: sub1, dtype: int64

In [157]:
rfm3['sub2'] = rfm3['SubGroup2'].apply(lambda x: fillSubgroup3(x))

In [311]:
rfm3.sub2.value_counts()

                     59563
Promising             4909
Middle_F              4884
High_F & Medium_M     3794
Medium_High_Risk      2767
High_Risk             1757
Top                     26
Elite                    2
Name: sub2, dtype: int64

In [159]:
test = df.copy()

In [92]:
indx = test.V1

In [93]:
indx2 = rfm1.V1

In [94]:
notcommon = [x if x not in indx else '' for x in indx2]

In [96]:
notcommon[notcommon != '']

''

In [102]:
test['V1'].nunique()

77702

In [104]:
rfm1['V1'].nunique()

77702

## Merge With Master

### Start with RFM1 and RFM2

In [341]:
res = pd.merge(df, rfm1, on = 'V1', how = 'right')
res = pd.merge(res, rfm2, on = 'V1', how = 'right')

In [313]:
res['sub1_x'].unique()

array(['', 'Medium_Risk', 'Middle_F', 'High_F & Medium_F', 'Promising'], dtype=object)

In [314]:
res['sub1_y'].unique()

array(['', 'High_F & Medium_M', 'Medium_High_Risk', 'Middle_F',
       'Promising', 'Top'], dtype=object)

In [342]:
"""
At the end we only want one column with different values. Since using the merge method will overwrite the values, we 
will use the statements below to fill the subgroup info. 
The value for SubGroup1_x will be changed if and only if it did not have any value assigned. This is avoid overwriting 
empty values to existing strings.
"""
#Fill SubGroup1_x with SubGroup2_x if SubGroup1_x != '', else keep old value
res['SubGroup1_x'] = res.apply(lambda x: x['SubGroup1_y'] if np.isnan(x['SubGroup1_x']) \
                               else x['SubGroup1_x'], axis = 1)
res['SubGroup2_x'] = res.apply(lambda x: x['SubGroup2_y'] if np.isnan(x['SubGroup2_x']) \
                               else x['SubGroup2_x'], axis = 1)

In [317]:
res['SubGroup1_x'].unique()

array([ nan,   1.,   2.,   4.,   3.,   5.])

### Make sure the replacements went well

In [318]:
rfm1['SubGroup1'].value_counts()

3.0    1501
4.0     725
1.0     593
2.0      60
Name: SubGroup1, dtype: int64

In [319]:
rfm2['SubGroup1'].value_counts()

5.0    944
2.0    923
1.0    481
4.0     14
3.0      2
Name: SubGroup1, dtype: int64

In [343]:
res['SubGroup1_x'].value_counts()

3.0    1503
1.0    1074
2.0     983
5.0     944
4.0     739
Name: SubGroup1_x, dtype: int64

In [344]:
res['sub1_x'] = res.apply(lambda x: fillSubgroup2(x['sub1_x'], x['SubGroup1_x']), axis = 1)

In [345]:
res['sub1_x'].unique()

array(['', 'High_F & Medium_M', 'Medium_High_Risk', 'Medium_Risk',
       'Middle_F', 'High_F & Medium_F', 'Promising', 'Top'], dtype=object)

In [346]:
res['sub2_x'] = res.apply(lambda x: fillSubgroup2(x['sub2_x'], x['SubGroup2_x']), axis = 1)

### Do the same to merge with RFM3

In [347]:
res = pd.merge(res, rfm3, on = 'V1', how = 'right')

In [324]:
res.head()

,V1,CUSTOMER_ID_x,CUSTOMER_BRANCH_x,ATLAS_CUSTOMER_MAINCODE_FORDUPLICATE,ACCOUNT_TYPE,LIFECYCLESTAGE,COMMERCIAL_STAGE,ATLAS_STATUS,CUSTOMER_TYPE,CUSTOMER_SUBTYPE,...,M1,M2,S1,S2,MainGroup1,MainGroup2,SubGroup1,SubGroup2,sub1,sub2
0,8,8,1,-9999,MAIN ACCOUNT,4. INACTIVE,LOST,INACTIVE,TOUR OPERATOR,NaN,...,2142.09,1987.87,138.0,150.0,3. Experienced Customers,3. Experienced Customers,2.0,2.0,Promising,Promising
1,693,18,1,-9999,MAIN ACCOUNT,4. INACTIVE,LOST,INACTIVE,NaN,NaN,...,0.00,0.00,137.0,149.0,4. Inactive Experienced Customers,4. Inactive Experienced Customers,NaN,NaN,,
2,700,25,1,-9999,MAIN ACCOUNT,4. INACTIVE,LOST,INACTIVE,TOUR OPERATOR,NaN,...,1979.10,3456.89,89.0,101.0,3. Experienced Customers,3. Experienced Customers,6.0,2.0,High_F & Medium_M,Promising
3,701,27,1,-9999,MAIN ACCOUNT,3.EXISTING CUSTOMER,SELLING,ACTIVE,OTHER TRAVEL COMPANY,DMC,...,0.00,0.00,130.0,142.0,4. Inactive Experienced Customers,4. Inactive Experienced Customers,NaN,NaN,,
4,703,29,1,-9999,MAIN ACCOUNT,4. INACTIVE,LOST,INACTIVE,NaN,NaN,...,0.00,0.00,126.0,138.0,4. Inactive Experienced Customers,4. Inactive Experienced Customers,NaN,NaN,,

In [348]:
res['sub2_x'].unique()

array(['', 'Middle_F', 'High_F & Medium_M', 'Medium_High_Risk',
       'Medium_Risk', 'High_F & Medium_F', 'Promising', 'Top'], dtype=object)

In [349]:
res['sub2'].unique()

array(['Promising', '', 'Middle_F', 'High_F & Medium_M', 'High_Risk',
       'Medium_High_Risk', 'Top', 'Elite'], dtype=object)

In [350]:
res['sub2_y'].unique()

array(['', 'Middle_F', 'High_F & Medium_M', 'Medium_High_Risk',
       'Promising', 'Top'], dtype=object)

In [351]:
res['SubGroup1_x'] = res.apply(lambda x: x['SubGroup1'] if np.isnan(x['SubGroup1_x']) \
                               else x['SubGroup1_x'], axis = 1)

In [352]:
res['SubGroup2_x'] = res.apply(lambda x: x['SubGroup2'] if np.isnan(x['SubGroup2_x']) \
                               else x['SubGroup2_x'], axis = 1)

In [353]:
res['sub1_x'] = res.apply(lambda x: fillSubgroup3(x['sub1_x'], x['SubGroup1_x']), axis = 1)
res['sub2_x'] = res.apply(lambda x: fillSubgroup3(x['sub2_x'], x['SubGroup2_x']), axis = 1)

In [354]:
res.sub1_x.unique()

array(['Promising', '', 'High_F & Medium_M', 'Middle_F',
       'Medium_High_Risk', 'High_Risk', 'Top', 'Medium_Risk',
       'High_F & Medium_F'], dtype=object)

In [355]:
res.sub2_x.unique()

array(['Promising', '', 'Middle_F', 'High_F & Medium_M', 'High_Risk',
       'Medium_High_Risk', 'Top', 'Medium_Risk', 'High_F & Medium_F',
       'Elite'], dtype=object)

In [356]:
rfm1['SubGroup1'].value_counts()

3.0    1501
4.0     725
1.0     593
2.0      60
Name: SubGroup1, dtype: int64

In [357]:
rfm2['SubGroup1'].value_counts()

5.0    944
2.0    923
1.0    481
4.0     14
3.0      2
Name: SubGroup1, dtype: int64

In [358]:
rfm3['SubGroup1'].value_counts()

1.0    3963
6.0    3466
2.0    3339
4.0    2216
7.0    1232
3.0      20
Name: SubGroup1, dtype: int64

In [359]:
res['SubGroup1_x'].value_counts()

1.0    5037
2.0    4322
6.0    3466
4.0    2955
3.0    1523
7.0    1232
5.0     944
Name: SubGroup1_x, dtype: int64

In [366]:
res.index[res.columns == 'SubGroup1_x']

/anaconda/envs/python3/lib/python3.5/site-packages/pandas/core/indexes/base.py:1700: VisibleDeprecationWarning: boolean index did not match indexed array along dimension 0; dimension is 77702 but corresponding boolean dimension is 987
  result = getitem(key)

Int64Index([951], dtype='int64')

In [367]:
res.columns[951]

'SubGroup1_x'

In [370]:
res.columns[954]

'CUSTOMER_ID_x'

In [387]:
result = res.iloc[:,:955]

In [388]:
result.head()

,V1,CUSTOMER_ID_x,CUSTOMER_BRANCH_x,ATLAS_CUSTOMER_MAINCODE_FORDUPLICATE,ACCOUNT_TYPE,LIFECYCLESTAGE,COMMERCIAL_STAGE,ATLAS_STATUS,CUSTOMER_TYPE,CUSTOMER_SUBTYPE,...,M1_x,M2_x,S1_x,S2_x,MainGroup1_x,MainGroup2_x,SubGroup1_x,SubGroup2_x,sub1_x,sub2_x
0,8,8,1,-9999,MAIN ACCOUNT,4. INACTIVE,LOST,INACTIVE,TOUR OPERATOR,NaN,...,2142.09,1987.87,138.0,150.0,3. Experienced Customers,3. Experienced Customers,2.0,2.0,Promising,Promising
1,693,18,1,-9999,MAIN ACCOUNT,4. INACTIVE,LOST,INACTIVE,NaN,NaN,...,0.00,0.00,137.0,149.0,4. Inactive Experienced Customers,4. Inactive Experienced Customers,NaN,NaN,,
2,700,25,1,-9999,MAIN ACCOUNT,4. INACTIVE,LOST,INACTIVE,TOUR OPERATOR,NaN,...,1979.10,3456.89,89.0,101.0,3. Experienced Customers,3. Experienced Customers,6.0,2.0,High_F & Medium_M,Promising
3,701,27,1,-9999,MAIN ACCOUNT,3.EXISTING CUSTOMER,SELLING,ACTIVE,OTHER TRAVEL COMPANY,DMC,...,0.00,0.00,130.0,142.0,4. Inactive Experienced Customers,4. Inactive Experienced Customers,NaN,NaN,,
4,703,29,1,-9999,MAIN ACCOUNT,4. INACTIVE,LOST,INACTIVE,NaN,NaN,...,0.00,0.00,126.0,138.0,4. Inactive Experienced Customers,4. Inactive Experienced Customers,NaN,NaN,,

In [389]:
result.sub2_x.unique()

array(['Promising', '', 'Middle_F', 'High_F & Medium_M', 'High_Risk',
       'Medium_High_Risk', 'Top', 'Medium_Risk', 'High_F & Medium_F',
       'Elite'], dtype=object)

In [390]:
result.to_csv('masterv2.csv')